"""
Решение:
1) Перебирать все числа циклом долго, а нужен быстрый код
2) Количество чисел до n, которые делятся на k, это n//k
3) Из n чисел убираем те, что делятся на 2, на 3 или на 5: n-n//2-n//3-n//5
4) Числа, которые делятся сразу на два из чисел (на 6, 10, 15), вычли два раза, поэтому возвращаем: +n//6+n//10+n//15
5) Числа, которые делятся на 2, 3 и 5 сразу (на 30), вычли 3 раза и вернули 3 раза, значит их нужно вычесть ещё раз: -n//30
6) Получается: n-n//2-n//3-n//5+n//6+n//10+n//15-n//30
7) Проверяем. Для n=30 подходят 1, 7, 11, 13, 17, 19, 23, 29, это 8 чисел, по формуле 30-15-10-6+5+3+2-1=8
"""

n = int(input("Введите n: "))

if n <= 0:
    print("Данные неверны!")
else:
    count = n - n // 2 - n // 3 - n // 5 + n // 6 + n // 10 + n // 15 - n // 30
    print(count)