"""
Решение:
1) В условии есть подсказка про параметрические кривые, сетка 8x8, можно загуглить => кривая Гильберта
2) Кривая проходит по всем 64 клеткам по одному разу, порядок квадрантов: нижний левый, верхний левый, верхний правый, нижний правый
3) Начинаем с угла д: д, ж, о, н, а, т, а, н => Джонатан, значит угол выбран верно
4) Читаем все буквы по кривой: Джонатан, напиши в ответе первые восемнадцать цифр числа пи после запятой
5) Число пи=3.14159265358979323846...
6) 18 цифр после запятой: 141592653589793238
7) Проверяем. 14159 26535 89793 238, это 5+5+5+3=18 цифр
"""

HOURS_IN_DAY = 24
PARTS = 5

# t+5*t=24, значит t=24/(5+1)
passed = HOURS_IN_DAY // (PARTS + 1)

print(f"Сейчас {passed}:00")