# 1.  Хранение текущего количества студентов в группе.
students_count = 25  # int - количество людей — целое число

# 2.  Хранение температуры в градусах Цельсия (например, 23.5).
temperature = 23.5  # float - т.к. температура содержит дробную часть

# 3.  Хранение логина пользователя (например, "ivanov_ivan").
username = "ivanov_ivan"  # str - простой текст

# 4.  Хранение информации о том, включено ли уведомление (да/нет).
is_notifications_enabled = True  # bool - принимает значение True (да) или False (нет)

# 5.  Хранение списка любимых фильмов.
favorite_movies = ["Jurassic Park", "Spider-Man", "Transformers"]  # list - список с возможностью добавления и изменения элементов

# 6.  Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания.
coordinates = (10, 20)  # tuple - неизменяемый кортеж для защиты координат от перезаписи

# 7.  Хранение уникальных ID товаров в корзине покупок.
item_ids = {101, 102, 103}  # set - множество исключает дубликаты

# 8.  Хранение соответствия между названием страны и её столицей.
capitals = {"Россия": "Москва", "Франция": "Париж"}  # dict - словарь для хранения парных данных