cost = int(input("Введите цену услуги ведьмака (натуральное число): "))  # цена услуги
coins = 0              # счётчик монет

while cost > 0:        # пока долг не выплачен полностью
    if cost >= 25:
        cost -= 25     # отдаём монетку номиналом 25
    elif cost >= 10:
        cost -= 10     # отдаём монетку номиналом 10
    elif cost >= 5:
        cost -= 5      # отдаём монетку номиналом 5
    else:
        cost -= 1      # отдаём монетку номиналом 1
    coins += 1         # отдаём монетку

print(f"Минимальное количество монет, нужное для этой услуги: {coins}")