n = int(input("Введите натуральное число: "))

last = n % 10      # последняя цифра числа (сразу узнаём её чтобы потом узнат ьсколько их)
count_3 = 0        # сколько цифр 3
count_last = 0     # сколько раз встречается последняя цифра
count_even = 0     # сколько чётных цифр
sum_big5 = 0        # сумма цифр больше 5
prod_big7 = 1       # произведение цифр больше 7, ставим 1 чтобы произведение не стало 0
count_0_5 = 0      # сколько цифр 0 и 5 суммарно

while n > 0:            # пока в числе остались цифры
    number = n % 10     # берём последнюю цифру

    if number == 3:
        count_3 += 1
    if number == last:
        count_last += 1
    if number % 2 == 0:
        count_even += 1
    if number > 5:
        sum_big5 += number
    if number > 7:
        prod_big7 *= number
    if number == 0 or number == 5:
        count_0_5 += 1
    n = n // 10       # убираем последнюю цифру, чтобы пересчитать всё по циклу

print(f"Количество цифр 3: {count_3}")
print(f"Сколько раз встречается последняя цифра: {count_last}")
print(f"Количество чётных цифр: {count_even}")
print(f"Сумма цифр больше 5: {sum_big5}")
print(f"Произведение цифр больше 7: {prod_big7}")
print(f"Количество цифр 0 и 5: {count_0_5}")