count = 0         # сколько людей между ними
found = False   # флаг на то встретили Александру или нет

print(f"Построчно введите список имён участников, начав с Александры и закончив Левоном:")

while True:
    name = input().lower()   # читаем имя внутри цикла
    if name == "левон":      # стоп-значение
        break
    if found == True:        # Александра уже была, значит человек между ними
        count += 1
    if name == "александра":
        found = True         # запоминаем, что Александру прошли

print(f"Количество участников между Александрой и Левоном: {count}")